In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('/data/test_patients.csv')

In [4]:
data['sex'].value_counts()

F    16
M    13
Name: sex, dtype: int64

In [6]:
sex_mapping = {
    'M': 'male',
    'F': 'female'
}

data['sex'].map(sex_mapping)

0       male
1       male
2     female
3     female
4     female
5       male
6       male
7     female
8     female
9       male
10    female
11      male
12    female
13    female
14    female
15    female
16      male
17    female
18    female
19    female
20      male
21    female
22    female
23      male
24      male
25      male
26      male
27    female
28      male
Name: sex, dtype: object

In [7]:
sex_mapping

{'M': 'male', 'F': 'female'}

In [8]:
sex_mapping['M']

'male'

In [9]:
sex_mapping['F']

'female'

In [10]:
for abbreviation, word in sex_mapping.items():
    print(f'{abbreviation} -> {word}')

M -> male
F -> female

In [16]:
data = pd.DataFrame([
    [1, 'Paul', 45],
    [2, 'Sarahlynn', pd.NA],
    [3, pd.NA, pd.NA]
], columns=['Number','Name','Age'])

In [17]:
data

   Number       Name   Age
0       1       Paul    45
1       2  Sarahlynn  <NA>
2       3       <NA>  <NA>

In [18]:
data.dropna()

   Number  Name Age
0       1  Paul  45

In [19]:
data.dropna(subset=['Name'])

   Number       Name   Age
0       1       Paul    45
1       2  Sarahlynn  <NA>

In [26]:
data = pd.DataFrame([
    [1, 'Paul', 45, 'M', 6.3],
    [2, 'Sarahlynn', 48, 'F', 5.4],
    [3, 'Ellie', 19, 'F', 5.0],
    [4, 'Ada', 15, 'F', 5.5],
    [5, 'Teddy', 11, 'M', 5.3]
], columns=['Number','Name','Age', 'Gender', 'Height'])

In [27]:
data

   Number       Name  Age Gender  Height
0       1       Paul   45      M     6.3
1       2  Sarahlynn   48      F     5.4
2       3      Ellie   19      F     5.0
3       4        Ada   15      F     5.5
4       5      Teddy   11      M     5.3

In [29]:
data.groupby('Gender').agg({
    'Age': ['mean','sum','median'],
    'Height': ['min','max']
})

              Age            Height
             mean sum median    min  max
Gender
F       27.333333  82     19    5.0  5.5
M       28.000000  56     28    5.3  6.3

In [30]:
data = pd.DataFrame([
    [1, 'Paul', 45, 'M', 6.3],
    [2, 'Sarahlynn', 48, 'F', 5.4],
    [3, 'Ellie', 19, 'F', 5.0],
    [4, 'Ada', 15, 'F', 5.5],
    [5, 'Teddy', 11, 'M', 5.3]
], columns=['Number','Name','Age', 'Gender', 'Height'])

In [31]:
data

   Number       Name  Age Gender  Height
0       1       Paul   45      M     6.3
1       2  Sarahlynn   48      F     5.4
2       3      Ellie   19      F     5.0
3       4        Ada   15      F     5.5
4       5      Teddy   11      M     5.3

In [38]:
def categorize_age(age):
    if age > 65:
        return 'retired'
    elif age < 18:
        return 'still a kid'
    else:
        return 'overworked'

In [42]:
categorize_age(14)

'still a kid'

In [43]:
data['Age'].apply(categorize_age)

0     overworked
1     overworked
2     overworked
3    still a kid
4    still a kid
Name: Age, dtype: object

In [48]:
data['category'] = data.loc[data['Gender'] == 'M','Age'].apply(categorize_age)

In [49]:
data

   Number       Name  Age Gender  Height     category
0       1       Paul   45      M     6.3   overworked
1       2  Sarahlynn   48      F     5.4          NaN
2       3      Ellie   19      F     5.0          NaN
3       4        Ada   15      F     5.5          NaN
4       5      Teddy   11      M     5.3  still a kid